// [1] 데이터와 타입
3;      // 숫자타입의 데이터 3
3.14;   // 숫자타입의 데이터 3.14
12345;   // 숫자타입의 데이터 12345

'안녕 JS1';   // 문자열타입의 데이터
"안녕 JS2";   // 문자열타입의 데이터
`안녕 JS3`;   // 문자열타입의 데이터 

true;        // 논리타입
false;       // 논리타입
            // JS 는 실수와 정수를 Number 타입으로 관리한다.


// [2] 데이터 출력하기
console.log(3);
console.log(3.14);
console.log(12345); 
console.log('안녕 JS1');
console.log("안녕 JS2");
console.log(`안녕 JS3`);
console.log(true);
console.log(false);


// [간단한 실습] 콘솔창에 아래와 같은 모양을 출력하시오.
// 확인 주의할 점 : 크롬에서는 백슬래시가 원화기호로 표시된다.

console.log(`\\    /\\ \n )   ( \') \n(  /  )\n \\(__)|`);


// [3] 브라우저에서 입력받기
prompt();
prompt(`[안내] 아무거나 입력하세요.`);
